snlkuharlocal/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБух</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентовПоКредиту</name>
    <type>
      <types>EnumRef.СпособыРасчетаПроцентовПоКредиту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПоКредиту</name>
    <comment>Процент по кредиту (Периодический реквизит)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора_Новый</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассовыйДоговорТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>CatalogRef.КодыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиСБ</name>
    <comment>Процент скидки для сезонного бонусуа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользованияДоговоров</name>
    <comment>0 - указыввается вручную, 1 - расчеты по счетам, 2 - используется основной договор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляОплаты</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьМатрицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАрхивнойКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверкиСБ</name>
    <type>
      <types>CatalogRef.РезультатыПроверкиСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическоеПлечо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеФайлы</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ДополнительныеФайлыДоговора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/ОбменЭДО/Module.bsl
Процедура УстановитьДоговорСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаДоговор="Договор") Экспорт
	Контрагент	=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Договор		=ДокументОбъект[ИмяРеквизитаДоговор];
	Организация	=ДокументОбъект.Организация;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	//По просьбе Ярослава, задача № 0000000468 
	//Если НЕ(Договор.Пустая()) Тогда
	//	Если СокрЛП(Договор.КодЦБ)=СокрЛП(КодЦБ) Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли;
	
	ДокументОбъект[ИмяРеквизитаДоговор]=Неопределено;
	
	Если Контрагент.Пустая() Тогда Возврат КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) Тогда
		Договора=ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация);
	Иначе
		Договора=Новый Массив;	
		Договора.Добавить(Контрагент.ОсновнойДоговор);
	КонецЕсли;	
	
	//Нечаева// 
	Если Договора.ВГраница()<0 Тогда
		//Предупреждение("Невозможно определить договор контрагента !");
	ИначеЕсли Договора.ВГраница()=0 Тогда
		ДокументОбъект[ИмяРеквизитаДоговор]=Договора[0];			
	Иначе
		#Если клиент тогда
		сообщить("У контрагента: """+Контрагент+""" заключено несколько договоров с организацией """+Организация+""" !"+Символы.ПС+
		"Основной договор для данного контрагента не указан !"+Символы.ПС+
		"Требуется вручную выбрать необходимый договор !");
		записатьвлог("b2b",""+Контрагент+" заключено несколько договоров с организацией "+Организация+"! Основной договор для данного контрагента не указан !Требуется вручную выбрать необходимый договор !",,,,);
		#конецЕсли
	КонецЕсли;	

КонецПроцедуры

Процедура УстановитьПунктДоставкиСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") Экспорт
	
	Контрагент = ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПДСервер(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;
	
КонецПроцедуры//УстановитьПунктДоставки(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент")

Функция ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация=Неопределено)  Экспорт
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		//Если задана организация то договора с другой организацией пропускаем
		//	Если Организация<>Неопределено И НЕ Организация.Пустая() И Выборка.Организация<>Организация Тогда Продолжить КонецЕсли; 	
		
		
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()

Функция КоличествоПДСервер(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)
